export const SONATA_EFFECTS = [
  {
    setName: "야밤의 서리",
    effect: {
      twoPiece: "응결 피해가 10% 증가된다",
      fivePiece: "일반 공격이나 강공격을 사용하면, 응결 피해가 10% 증가, 해당 효과는 3스택 중첩이 가능하며, 15초간 지속된다"
    }
  },
  {
    setName: "솟구치는 용암",
    effect: {
      twoPiece: "용융 피해가 10% 증가된다",
      fivePiece: "공명 스킬 사용 시, 용융 피해가 30% 증가되며, 15초 동안 지속된다"
    }
  },
  {
    setName: "울려퍼지는 뇌음",
    effect: {
      twoPiece: "전도 피해가 10% 증가된다",
      fivePiece: "강공격 또는 공명 스킬 사용 시, 전도 피해가 15% 증가된다, 해당 효과는 2스택 중첩이 가능하다, 각 스택당 15초 동안 지속된다"
    }
  },
  {
    setName: "스쳐가는 바람",
    effect: {
      twoPiece: "기류 피해가 10% 증가된다",
      fivePiece: "변주 스킬을 사용하여 등장 시, 기류 피해가 30% 증가하고, 15초 동안 지속된다"
    }
  },
  {
    setName: "빛나는 별",
    effect: {
      twoPiece: "회절 피해가 10% 증가된다",
      fivePiece: "변주 스킬을 사용하여 등장 시, 회절 피해가 30% 증가되고, 15초 동안 지속된다"
    }
  },
  {
    setName: "빛을 삼키는 해",
    effect: {
      twoPiece: "인멸 피해가 10% 증가된다",
      fivePiece: "일반 공격 또는 강공격 사용 시, 인멸 피해가 7.5% 증가되고, 해당 효과는 4스택 중첩이 가능하며, 15초 동안 지속된다"
    }
  },
  {
    setName: "찬란한 광휘",
    effect: {
      twoPiece: "치료 효과가 10% 증가된다",
      fivePiece: "파티원 치료 시, 파티 전체의 공격력이 15% 증가하며, 30초간 지속된다"
    }
  },
  {
    setName: "떠오르는 구름",
    effect: {
      twoPiece: "공명 효율이 10% 증가된다",
      fivePiece: "반주 스킬을 사용한 후, 다음에 등장하는 공명자의 공격력이 22.5% 증가하며, 15초 동안 지속된다"
    }
  },
  {
    setName: "끊임없는 잔향",
    effect: {
      twoPiece: "공격력이 10% 증가된다",
      fivePiece: "출전 시, 자신의 공격력이 1.5초마다 5% 증가하며, 해당 효과는 최대 4스택까지 중첩된다. 반주 스킬 피해가 60% 증가된다"
    }
  },
  {
    setName: "냉철한 결단",
    effect: {
      twoPiece: "공명 스킬 피해가 12% 증가된다",
      fivePiece: "공명 스킬 발동 시, 자신의 응결 피해가 22.5% 증가되고, 15초간 지속된다. 공명 해방 발동 시, 자신의 공명 스킬 피해가 18% 증가되고, 5초간 지속되며, 최대 2스택 중첩이 가능하다"
    }
  },
  {
    setName: "영원의 광채",
    effect: {
      twoPiece: "회절 피해가 10% 증가된다",
      fivePiece: "캐릭터가 적에게 「광학 효과」를 추가 시, 자신의 크리티컬이 20% 증가되고 15초간 지속된다. 「광학 효과」가 10스택인 적을 공격 시, 자신의 회절 피해 보너스가 15% 증가되고 15초간 지속된다"
    }
  },
  {
    setName: "어둠의 장막",
    effect: {
      twoPiece: "인멸 피해가 10% 증가된다",
      fivePiece: "캐릭터가 반주 스킬을 발생시키고 퇴장 시, 추가로 주변 적에게 480%의 인멸 피해를 입히고, 해당 피해는 반주 스킬 피해로 적용되며, 다음에 등장하는 캐릭터의 인멸 피해 보너스를 15% 증가시키고, 15초간 지속된다"
    }
  },
  {
    setName: "하늘의 합주곡",
    effect: {
      twoPiece: "공명 효율이 10% 증가된다",
      fivePiece: "현재 캐릭터의 협동 공격이 입히는 피해가 80% 증가된다. 협동 공격으로 적을 명중하여 크리티컬이 발생할 경우, 파티 내 등장 캐릭터의 공격력이 20% 증가되고, 4초간 지속된다"
    }
  },
  {
    setName: "파도에 맞선 용기",
    effect: {
      twoPiece: "공명 효율이 10% 증가된다",
      fivePiece: "캐릭터의 공격력이 15% 증가되고, 공명 효율이 250%에 도달한 후 현재 캐릭터의 전체 속성 피해가 30% 증가된다"
    }
  },
  {
    setName: "끝없는 하늘",
    effect: {
      twoPiece: "기류 피해가 10% 증가된다",
      fivePiece: "캐릭터가 적에게 「풍식 효과」를 추가 시, 파티 내 캐릭터의 기류 피해가 15% 증가되고, 자신의 기류 피해가 추가로 15% 증가되며, 20초간 지속된다"
    }
  },
  {
    setName: "영광이 깃든 바람",
    effect: {
      twoPiece: "기류 피해가 10% 증가된다",
      fivePiece: "공격으로 「풍식 효과」가 있는 목표 명중 시, 자신의 크리티컬이 10% 증가되고, 기류 피해가 30% 증가되며, 10초간 지속된다"
    }
  },
  {
    setName: "울부짖는 늑대의 불꽃",
    effect: {
      twoPiece: "용융 피해가 10% 증가된다",
      fivePiece: "공명 해방 발동 시, 파티 내 캐릭터의 용융 피해가 15% 증가되고, 자신의 공명 해방 피해가 20% 증가되며, 35초간 지속된다"
    }
  },
  {
    setName: "뒤틀린 피안의 꿈",
    effect: {
      threePiece: "캐릭터의 공명 에너지가 0일 시, 자신의 크리티컬이 20% 증가되고, 에코 어빌리티 피해 보너스가 35% 증가된다"
    }
  },
  {
    setName: "영광의 칼날로 만들어진 왕관",
    effect: {
      threePiece: "캐릭터가 실드 획득 시, 자신의 공격력이 6% 증가되고 크리티컬 피해가 4% 증가된다. 해당 효과는 최대 5스택까지 중첩이 가능하며, 4초간 지속되고 0.5초마다 1회 발생할 수 있다"
    }
  },
  {
    setName: "만물의 숨결에 비롯된 울림",
    effect: {
      threePiece: "캐릭터가 에코 어빌리티 발동 시, 자신의 강공격 피해 보너스가 30% 증가되고 4초간 지속된다. 파티 내 캐릭터의 에코 어빌리티 피해 보너스가 4% 증가되고, 최대 4스택 중첩이 가능하며 30초간 지속된다. 같은 이름의 에코일 시 해당 효과는 1회만 발생할 수 있으며, 효과 종료 시 같은 이름의 에코의 기록은 리셋되고, 4스택까지 중첩 시 에코 어빌리티를 발동할 경우 지속시간은 리셋된다"
    }
  },
  {
    setName: "불타는 깃털을 펼친 사냥꾼의 그림자",
    effect: {
      threePiece: "캐릭터가 에코 어빌리티 피해를 입힐 시, 강공격 피해의 크리티컬이 20% 증가되고 6초간 지속된다. 강공격 피해를 입힐 시, 에코 어빌리티 피해의 크리티컬이 20% 증가되고 6초간 지속된다. 두 가지 효과를 동시에 보유 시, 자신의 용융 피해가 16% 증가된다"
    }
  },
  {
    setName: "운명을 붕괴시키는 현",
    effect: {
      threePiece: "캐릭터가 적에게 「암흑 효과」 추가 시, 자신의 공격력이 20% 증가되고 공명 해방 피해 보너스가 30% 증가되며 5초간 지속된다"
    }
  },
  {
    setName: "역광 속 눈부신 서약",
    effect: {
      twoPiece: "회절 피해가 10% 증가된다",
      fivePiece: "캐릭터가 반주 스킬 발동 후, 다음번 변주 스킬로 등장하는 캐릭터의 공격력이 15% 증가된다. 조화도 파괴 증폭 1pt 당 공격력을 추가로 0.3% 증가시키고, 최대 15%까지 증가시키며, 15초간 지속된다. 다른 캐릭터로 전환하면 해당 효과는 즉시 종료된다"
    }
  },
  {
    setName: "빛을 쫓는 별의 고리",
    effect: {
      twoPiece: "치료 효과가 10% 증가된다",
      fivePiece: "캐릭터가 파티원 치료 시, 자신의 부조화 수치 누적 효율 1% 당 파티 내 캐릭터의 공격력을 0.2% 증가시키고, 최대 25%까지 증가시키며, 4초간 지속된다. 같은 이름의 효과는 중첩이 불가하다"
    }
  },
  {
    setName: "흐르는 금빛 속 진리의 답",
    effect: {
      twoPiece: "회절 피해가 10% 증가된다",
      fivePiece: "캐릭터가 일반 공격으로 피해를 입힐 시, 자신의 회절 피해가 10% 증가되고, 해당 효과는 3스택 중첩이 가능하며, 5초간 지속된다. 3스택까지 중첩 시, 공명 해방을 발동할 경우 일반 공격 피해 보너스가 40% 증가된다"
    }
  },
  {
    setName: "긴 여정을 떠나는 별",
    effect: {
      twoPiece: "용융 피해가 10% 증가된다",
      fivePiece: "캐릭터가 적에게 「불꽃 효과」 혹은 「조화 파동 · 이탈」 추가 시, 자신의 크리티컬이 20% 증가되고 용융 피해가 20% 증가되며, 8초간 지속된다"
    }
  },
  {
    setName: "오색찬란한 거품",
    effect: {
      twoPiece: "용융 피해가 10% 증가된다",
      fivePiece: "캐릭터가 적에게 「불꽃 효과」 추가 시, 자신은 다음과 같은 효과를 획득한다.\n용융 피해가 10% 증가되고, 15초간 지속된다. 지속 시간 내에 반주 스킬 발동 후, 다음 변주 스킬을 발동하여 등장하는 캐릭터의 용융 피해를 25% 증가시키고, 15초간 지속된다"
    }
  },
  {
    setName: "함의의 소리를 따라",
    effect: {
      twoPiece: "기류 피해가 10% 증가된다",
      fivePiece: "캐릭터가 에코 어빌리티 피해를 입힐 시, 에코 어빌리티 피해의 크리티컬이 20% 증가되고 자신의 기류 피해가 15% 증가되며 5초간 지속된다"
    }
  },
  {
    setName: "소리 없이 내려앉은 기도의 눈",
    effect: {
      twoPiece: "응결 피해가 10% 증가된다",
      fivePiece: "캐릭터가 목표에게 「서리 효과」 추가 시, 응결 피해가 10% 증가되고, 15초간 지속된다. 자신이 「강설」 효과를 획득하고 15초간 지속되며, 해당 효과는 25초마다 1회 발생할 수 있다.\n「강설」 효과 보유 시, 다음과 같은 효과를 획득한다.\n· 캐릭터가 공명 해방 피해를 입힐 시, 「강설」 효과를 제거하고 자신의 크리티컬을 25% 증가시키며, 6초간 지속된다. 해당 효과 지속 기간 동안 캐릭터가 공명 해방 피해를 입힐 시, 지속 시간은 4초 연장되고 0.5초마다 1회 발생할 수 있다. 매번 「강설」 효과 제거 후, 해당 효과는 최대 6회 발생할 수 있다.\n· 캐릭터가 반주 스킬 발동 시, 「강설」 효과를 제거하고 다음번 변주 스킬로 등장하는 캐릭터의 응결 피해를 25% 증가시키며 15초간 지속된다.\n매번 「강설」 효과 제거 시, 위의 효과는 동시에 1개만 발생할 수 있다"
    }
  },
  {
    setName: "마음을 엮은 꿈의 그림자",
    effect: {
      twoPiece: "공격력이 10% 증가된다",
      fivePiece: "캐릭터가 목표에게 「조화 파동 · 이탈」 혹은 「조화 밀집 · 이탈」 추가 시, 파티 내 캐릭터의 조화도 파괴 증폭이 20 증가되고, 30초간 지속된다. 같은 이름의 효과는 중첩이 불가하다"
    }
  },
  {
    setName: "꿈을 깨뜨리는 망령의 악몽",
    effect: {
      onePiece: "캐릭터가 적에게 「해킹 · 이탈」 추가 시, 자신의 일반 공격 피해 보너스와 강공격 피해 보너스가 35% 증가되며 15초간 지속된다"
    }
  }
];
